OpenFOAM-v1712/etc/templates/closedVolumeRotating/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInitial    1.0;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInitial;

boundaryField
{
    wall
    {
        type            omegaWallFunction;
        value           uniform $omegaInitial;
    }
}

// ************************************************************************* //
